Tekla Open API Reference for Tekla Structures 2025
LevelMark.Attributes Property
 Gets or sets the level mark attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LevelMark.LevelMarkAttributes Attributes { get; set; }
Public Property Attributes As LevelMark.LevelMarkAttributes
	Get
	Set
Property Value
Type: LevelMark.LevelMarkAttributes
See Also
Reference
LevelMark Class
Tekla.Structures.Drawing Namespace